Documents/ВводНачальныхОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ВводНачальныхОстатков</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоЛьготам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВзаиморасчетыСКонтрагентами</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидВзаиморасчетов</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВзаиморасчетыПоСубсидиям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВзаиморасчетыПоЛьготам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДенежныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БанковскийСчетКасса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЗапасыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ЗапасыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВводНачальныхОстатков/Ext/ManagerModule.bsl
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеЛицевыеСчета(ДокументСсылкаВводНачальныхОстатков, СтруктураДополнительныеСвойства)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВводНачальныхОстатковЛицевыеСчета.МесяцНачисления = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	КОНЕЦ КАК ВидДвижения,
		|	ВводНачальныхОстатковЛицевыеСчета.ЛицевойСчет,
		|	ВводНачальныхОстатковЛицевыеСчета.Услуга,
		|	ВводНачальныхОстатковЛицевыеСчета.МесяцНачисления,
		|	СУММА(ВЫБОР
		|			КОГДА ВводНачальныхОстатковЛицевыеСчета.МесяцНачисления = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА ВводНачальныхОстатковЛицевыеСчета.Сумма
		|			ИНАЧЕ ВводНачальныхОстатковЛицевыеСчета.Сумма
		|		КОНЕЦ) КАК Сумма,
		|	ВЫБОР
		|		КОГДА НЕ ВводНачальныхОстатковЛицевыеСчета.Услуга.Организация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
		|			ТОГДА ВводНачальныхОстатковЛицевыеСчета.Услуга.Организация
		|		ИНАЧЕ ВводНачальныхОстатковЛицевыеСчета.ЛицевойСчет.Владелец.Организация
		|	КОНЕЦ КАК Организация,
		|	ВводНачальныхОстатковЛицевыеСчета.Ссылка.Дата КАК Период,
		|	МИНИМУМ(ВводНачальныхОстатковЛицевыеСчета.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	Документ.ВводНачальныхОстатков.ЛицевыеСчета КАК ВводНачальныхОстатковЛицевыеСчета
		|ГДЕ
		|	ВводНачальныхОстатковЛицевыеСчета.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВводНачальныхОстатковЛицевыеСчета.ЛицевойСчет,
		|	ВводНачальныхОстатковЛицевыеСчета.Услуга,
		|	ВводНачальныхОстатковЛицевыеСчета.МесяцНачисления,
		|	ВводНачальныхОстатковЛицевыеСчета.Ссылка.Дата,
		|	ВЫБОР
		|		КОГДА НЕ ВводНачальныхОстатковЛицевыеСчета.Услуга.Организация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
		|			ТОГДА ВводНачальныхОстатковЛицевыеСчета.Услуга.Организация
		|		ИНАЧЕ ВводНачальныхОстатковЛицевыеСчета.ЛицевойСчет.Владелец.Организация
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВводНачальныхОстатков);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоЛицевымСчетам", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеЗапасы(ДокументСсылкаВводНачальныхОстатков, СтруктураДополнительныеСвойства)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВводНачальныхОстатковЗапасы.Ссылка.Организация,
		|	ВводНачальныхОстатковЗапасы.Ссылка.Дата КАК Период,
		|	ВводНачальныхОстатковЗапасы.Склад,
		|	ВводНачальныхОстатковЗапасы.Номенклатура,
		|	ВводНачальныхОстатковЗапасы.Количество,
		|	МИНИМУМ(ВводНачальныхОстатковЗапасы.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	Документ.ВводНачальныхОстатков.Запасы КАК ВводНачальныхОстатковЗапасы
		|ГДЕ
		|	ВводНачальныхОстатковЗапасы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВводНачальныхОстатковЗапасы.Ссылка.Организация,
		|	ВводНачальныхОстатковЗапасы.Номенклатура,
		|	ВводНачальныхОстатковЗапасы.Склад,
		|	ВводНачальныхОстатковЗапасы.Ссылка.Дата,
		|	ВводНачальныхОстатковЗапасы.Количество
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";	
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВводНачальныхОстатков);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладах", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеВзаиморасчетыСКонтрагентами(ДокументСсылкаВводНачальныхОстатков, СтруктураДополнительныеСвойства)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВводНачальныхОстатковВзаиморасчетыСКонтрагентами.Ссылка.Дата КАК Период,
		|	ВводНачальныхОстатковВзаиморасчетыСКонтрагентами.Ссылка.Организация,
		|	ВводНачальныхОстатковВзаиморасчетыСКонтрагентами.Контрагент,
		|	СУММА(ВводНачальныхОстатковВзаиморасчетыСКонтрагентами.Сумма) КАК СуммаВзаиморасчетов,
		|	ВводНачальныхОстатковВзаиморасчетыСКонтрагентами.ДоговорКонтрагента,
		|	МИНИМУМ(ВводНачальныхОстатковВзаиморасчетыСКонтрагентами.НомерСтроки) КАК НомерСтроки,
		|	ВводНачальныхОстатковВзаиморасчетыСКонтрагентами.ВидВзаиморасчетов КАК ВидНоменклатуры
		|ИЗ
		|	Документ.ВводНачальныхОстатков.ВзаиморасчетыСКонтрагентами КАК ВводНачальныхОстатковВзаиморасчетыСКонтрагентами
		|ГДЕ
		|	ВводНачальныхОстатковВзаиморасчетыСКонтрагентами.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВводНачальныхОстатковВзаиморасчетыСКонтрагентами.Ссылка.Организация,
		|	ВводНачальныхОстатковВзаиморасчетыСКонтрагентами.Контрагент,
		|	ВводНачальныхОстатковВзаиморасчетыСКонтрагентами.ДоговорКонтрагента,
		|	ВводНачальныхОстатковВзаиморасчетыСКонтрагентами.Ссылка.Дата,
		|	ВводНачальныхОстатковВзаиморасчетыСКонтрагентами.ВидВзаиморасчетов
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";	
	
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВводНачальныхОстатков);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыСКонтрагентами", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеВзаиморасчетыПоСубсидиям(ДокументСсылкаВводНачальныхОстатков, СтруктураДополнительныеСвойства)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВводНачальныхОстатковВзаиморасчетыПоСубсидиям.Ссылка.Дата КАК Период,
		|	ВводНачальныхОстатковВзаиморасчетыПоСубсидиям.Ссылка.Организация,
		|	ВводНачальныхОстатковВзаиморасчетыПоСубсидиям.Контрагент,
		|	ВводНачальныхОстатковВзаиморасчетыПоСубсидиям.ДоговорКонтрагента,
		|	ВводНачальныхОстатковВзаиморасчетыПоСубсидиям.Услуга,
		|	СУММА(ВводНачальныхОстатковВзаиморасчетыПоСубсидиям.Сумма) КАК Сумма,
		|	МИНИМУМ(ВводНачальныхОстатковВзаиморасчетыПоСубсидиям.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	Документ.ВводНачальныхОстатков.ВзаиморасчетыПоСубсидиям КАК ВводНачальныхОстатковВзаиморасчетыПоСубсидиям
		|ГДЕ
		|	ВводНачальныхОстатковВзаиморасчетыПоСубсидиям.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВводНачальныхОстатковВзаиморасчетыПоСубсидиям.Ссылка.Организация,
		|	ВводНачальныхОстатковВзаиморасчетыПоСубсидиям.Контрагент,
		|	ВводНачальныхОстатковВзаиморасчетыПоСубсидиям.ДоговорКонтрагента,
		|	ВводНачальныхОстатковВзаиморасчетыПоСубсидиям.Услуга,
		|	ВводНачальныхОстатковВзаиморасчетыПоСубсидиям.Ссылка.Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";	
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВводНачальныхОстатков);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыПоСубсидиям", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеВзаиморасчетыПоЛьготам(ДокументСсылкаВводНачальныхОстатков, СтруктураДополнительныеСвойства)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВводНачальныхОстатковВзаиморасчетыПоЛьготам.Ссылка.Дата КАК Период,
		|	ВводНачальныхОстатковВзаиморасчетыПоЛьготам.Ссылка.Организация,
		|	ВводНачальныхОстатковВзаиморасчетыПоЛьготам.Контрагент,
		|	ВводНачальныхОстатковВзаиморасчетыПоЛьготам.ДоговорКонтрагента,
		|	ВводНачальныхОстатковВзаиморасчетыПоЛьготам.Услуга,
		|	СУММА(ВводНачальныхОстатковВзаиморасчетыПоЛьготам.Сумма) КАК Сумма,
		|	МИНИМУМ(ВводНачальныхОстатковВзаиморасчетыПоЛьготам.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	Документ.ВводНачальныхОстатков.ВзаиморасчетыПоЛьготам КАК ВводНачальныхОстатковВзаиморасчетыПоЛьготам
		|ГДЕ
		|	ВводНачальныхОстатковВзаиморасчетыПоЛьготам.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВводНачальныхОстатковВзаиморасчетыПоЛьготам.Ссылка.Организация,
		|	ВводНачальныхОстатковВзаиморасчетыПоЛьготам.Контрагент,
		|	ВводНачальныхОстатковВзаиморасчетыПоЛьготам.ДоговорКонтрагента,
		|	ВводНачальныхОстатковВзаиморасчетыПоЛьготам.Услуга,
		|	ВводНачальныхОстатковВзаиморасчетыПоЛьготам.Ссылка.Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";	
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВводНачальныхОстатков);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыПоЛьготам", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДенежныеСредства(ДокументСсылкаВводНачальныхОстатков, СтруктураДополнительныеСвойства)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВводНачальныхОстатковДенежныеСредства.Ссылка.Дата КАК Период,
		|	ВводНачальныхОстатковДенежныеСредства.Ссылка.Организация,
		|	ВводНачальныхОстатковДенежныеСредства.БанковскийСчетКасса,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ВводНачальныхОстатковДенежныеСредства.БанковскийСчетКасса) = ТИП(Справочник.Кассы)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные)
		|	КОНЕЦ КАК ТипДенежныхСредств,
		|	СУММА(ВводНачальныхОстатковДенежныеСредства.Сумма) КАК Сумма,
		|	МИНИМУМ(ВводНачальныхОстатковДенежныеСредства.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	Документ.ВводНачальныхОстатков.ДенежныеСредства КАК ВводНачальныхОстатковДенежныеСредства
		|ГДЕ
		|	ВводНачальныхОстатковДенежныеСредства.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВводНачальныхОстатковДенежныеСредства.Ссылка.Организация,
		|	ВводНачальныхОстатковДенежныеСредства.БанковскийСчетКасса,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ВводНачальныхОстатковДенежныеСредства.БанковскийСчетКасса) = ТИП(Справочник.Кассы)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные)
		|	КОНЕЦ,
		|	ВводНачальныхОстатковДенежныеСредства.Ссылка.Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВводНачальныхОстатков);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредства", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаВводНачальныхОстатков, СтруктураДополнительныеСвойства) Экспорт

	РазделУчета = ДокументСсылкаВводНачальныхОстатков.РазделУчета;

	Если      РазделУчета = "Лицевые счета" Тогда

		ИнициализироватьДанныеЛицевыеСчета(ДокументСсылкаВводНачальныхОстатков, СтруктураДополнительныеСвойства);

	ИначеЕсли РазделУчета = "Запасы" Тогда

		ИнициализироватьДанныеЗапасы(ДокументСсылкаВводНачальныхОстатков, СтруктураДополнительныеСвойства);

	ИначеЕсли РазделУчета = "Взаиморасчеты с контрагентами" Тогда
		
		ИнициализироватьДанныеВзаиморасчетыСКонтрагентами(ДокументСсылкаВводНачальныхОстатков, СтруктураДополнительныеСвойства);
		
	ИначеЕсли РазделУчета = "Взаиморасчеты по субсидиям" Тогда

		ИнициализироватьДанныеВзаиморасчетыПоСубсидиям(ДокументСсылкаВводНачальныхОстатков, СтруктураДополнительныеСвойства);
		
	ИначеЕсли РазделУчета = "Взаиморасчеты по льготам" Тогда

		ИнициализироватьДанныеВзаиморасчетыПоЛьготам(ДокументСсылкаВводНачальныхОстатков, СтруктураДополнительныеСвойства);
		
	ИначеЕсли РазделУчета = "Денежные средства" Тогда

		ИнициализироватьДанныеДенежныеСредства(ДокументСсылкаВводНачальныхОстатков, СтруктураДополнительныеСвойства);
		
	КонецЕсли;		
	
КонецПроцедуры


// Контроль раздела учета Запасы.
//
Процедура ВыполнитьКонтрольЗапасы(ДокументСсылкаВводНачальныхОстатков, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь)
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Если временные таблицы "ДвиженияЗапасыНаСкладахИзменение"
	// содержат записи, необходимо выполнить контроль отрицательных остатков.
	
	Если СтруктураВременныеТаблицы.ДвиженияЗапасыНаСкладахИзменение Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияЗапасыНаСкладахИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.Склад) КАК СкладПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыНаСкладахИзменение.Номенклатура) КАК НоменклатураПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗапасыНаСкладахОстатки.Номенклатура.БазоваяЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияЗапасыНаСкладахИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасыНаСкладах,
		|	ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыНаСкладах
		|ИЗ
		|	ДвиженияЗапасыНаСкладахИзменение КАК ДвиженияЗапасыНаСкладахИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки(
		|				&МоментКонтроля,
		|				(Организация, Склад, Номенклатура) В
		|					(ВЫБРАТЬ
		|						ДвиженияЗапасыНаСкладахИзменение.Организация КАК Организация,
		|						ДвиженияЗапасыНаСкладахИзменение.Склад КАК Склад,
		|						ДвиженияЗапасыНаСкладахИзменение.Номенклатура КАК Номенклатура
		|					ИЗ
		|						ДвиженияЗапасыНаСкладахИзменение КАК ДвиженияЗапасыНаСкладахИзменение)) КАК ЗапасыНаСкладахОстатки
		|		ПО ДвиженияЗапасыНаСкладахИзменение.Организация = ЗапасыНаСкладахОстатки.Организация
		|			И ДвиженияЗапасыНаСкладахИзменение.Склад = ЗапасыНаСкладахОстатки.Склад
		|			И ДвиженияЗапасыНаСкладахИзменение.Номенклатура = ЗапасыНаСкладахОстатки.Номенклатура
		|ГДЕ
		|	ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) < 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки");
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
		
		РезультатЗапроса = Запрос.Выполнить();

		// Отрицательный остаток запасов на складе.
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ДокументОбъектВводНачальныхОстатков = ДокументСсылкаВводНачальныхОстатков.ПолучитьОбъект();
			
			ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
			ОСМДСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыНаСкладахСписком(ДокументОбъектВводНачальныхОстатков, ВыборкаИзРезультатаЗапроса, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Контроль раздела учета ДенежныеСредства.
//
Процедура ВыполнитьКонтрольДенежныеСредства(ДокументСсылкаВводНачальныхОстатков, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь)
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Если временные таблицы "ДвиженияДенежныеСредстваИзменение"
	// содержат записи, необходимо выполнить контроль отрицательных остатков.
	
	Если СтруктураВременныеТаблицы.ДвиженияДенежныеСредстваИзменение Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияДенежныеСредстваИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияДенежныеСредстваИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияДенежныеСредстваИзменение.БанковскийСчетКасса) КАК БанковскийСчетКассаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияДенежныеСредстваИзменение.ТипДенежныхСредств) КАК ТипДенежныхСредствПредставление,
		|	ДвиженияДенежныеСредстваИзменение.ТипДенежныхСредств КАК ТипДенежныхСредств,
		|	ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ДвиженияДенежныеСредстваИзменение.СуммаИзменение + ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаОстаток, 0) КАК ОстатокДенежныхСредств,
		|	ДвиженияДенежныеСредстваИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
		|	ДвиженияДенежныеСредстваИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
		|	ДвиженияДенежныеСредстваИзменение.СуммаИзменение КАК СуммаИзменение
		|ИЗ
		|	ДвиженияДенежныеСредстваИзменение КАК ДвиженияДенежныеСредстваИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредства.Остатки(
		|				&МоментКонтроля,
		|				(Организация, ТипДенежныхСредств, БанковскийСчетКасса) В
		|					(ВЫБРАТЬ
		|						ДвиженияДенежныеСредстваИзменение.Организация КАК Организация,
		|						ДвиженияДенежныеСредстваИзменение.ТипДенежныхСредств КАК ТипДенежныхСредств,
		|						ДвиженияДенежныеСредстваИзменение.БанковскийСчетКасса КАК БанковскийСчетКасса
		|					ИЗ
		|						ДвиженияДенежныеСредстваИзменение КАК ДвиженияДенежныеСредстваИзменение)) КАК ДенежныеСредстваОстатки
		|		ПО ДвиженияДенежныеСредстваИзменение.Организация = ДенежныеСредстваОстатки.Организация
		|			И ДвиженияДенежныеСредстваИзменение.ТипДенежныхСредств = ДенежныеСредстваОстатки.ТипДенежныхСредств
		|			И ДвиженияДенежныеСредстваИзменение.БанковскийСчетКасса = ДенежныеСредстваОстатки.БанковскийСчетКасса
		|ГДЕ
		|	ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаОстаток, 0) < 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки");
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
		
		МассивРезультатов = Запрос.Выполнить();
		
		// Отрицательный остаток по денежным средствам.
		Если НЕ МассивРезультатов.Пустой() Тогда
			
			ДокументОбъектВводНачальныхОстатков = ДокументСсылкаВводНачальныхОстатков.ПолучитьОбъект();
			
			ВыборкаИзРезультатаЗапроса = МассивРезультатов.Выбрать();
			ОСМДСервер.СообщитьОбОшибкахПроведенияПоРегиструДенежныеСредства(ДокументОбъектВводНачальныхОстатков, ВыборкаИзРезультатаЗапроса, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтрольРасчетыПоЛицевымСчетам(ДокументСсылкаВводНачальныхОстатков, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Если временные таблицы "ДвиженияРасчетыПоЛицевымСчетамИзменение"
	// содержат записи, необходимо выполнить контроль отрицательных остатков.
	
	Если СтруктураВременныеТаблицы.ДвиженияРасчетыПоЛицевымСчетамИзменение Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияРасчетыПоЛицевымСчетамИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыПоЛицевымСчетамИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыПоЛицевымСчетамИзменение.ЛицевойСчет) КАК ЛицевойСчетПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыПоЛицевымСчетамИзменение.Услуга) КАК УслугаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыПоЛицевымСчетамИзменение.МесяцНачисления) КАК МесяцНачисленияПредставление,
		|	ЕСТЬNULL(ДвиженияРасчетыПоЛицевымСчетамИзменение.СуммаИзменение, 0) + ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) КАК ОстатокРасчетыПоЛицевымСчетам,
		|	ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) КАК СуммаОстатокРасчетыПоЛицевымСчетам
		|ИЗ
		|	ДвиженияРасчетыПоЛицевымСчетамИзменение КАК ДвиженияРасчетыПоЛицевымСчетамИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
		|				&МоментКонтроля,
		|				(Организация, ЛицевойСчет, Услуга, МесяцНачисления) В
		|					(ВЫБРАТЬ
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение.Организация КАК Организация,
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение.ЛицевойСчет КАК ЛицевойСчет,
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение.Услуга КАК Услуга,
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение.МесяцНачисления КАК МесяцНачисления
		|					ИЗ
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение КАК ДвиженияРасчетыПоЛицевымСчетамИзменение)) КАК РасчетыПоЛицевымСчетамОстатки
		|		ПО ДвиженияРасчетыПоЛицевымСчетамИзменение.Организация = РасчетыПоЛицевымСчетамОстатки.Организация
		|			И ДвиженияРасчетыПоЛицевымСчетамИзменение.ЛицевойСчет = РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет
		|			И ДвиженияРасчетыПоЛицевымСчетамИзменение.Услуга = РасчетыПоЛицевымСчетамОстатки.Услуга
		|			И ДвиженияРасчетыПоЛицевымСчетамИзменение.МесяцНачисления = РасчетыПоЛицевымСчетамОстатки.МесяцНачисления
		|ГДЕ
		|	ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) < 0
		|	И РасчетыПоЛицевымСчетамОстатки.МесяцНачисления <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И ДвиженияРасчетыПоЛицевымСчетамИзменение.МесяцНачисления <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки");
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		// Отрицательный остаток.
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ДокументОбъектВводНачальныхОстатков = ДокументСсылкаВводНачальныхОстатков.ПолучитьОбъект();
			
			ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
			ОСМДСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыПоЛицевымСчетамСписком(ДокументОбъектВводНачальныхОстатков, ВыборкаИзРезультатаЗапроса, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылкаВводНачальныхОстатков, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	РазделУчета = ДокументСсылкаВводНачальныхОстатков.РазделУчета;

	Если РазделУчета = "Лицевые счета" Тогда

		ВыполнитьКонтрольРасчетыПоЛицевымСчетам(ДокументСсылкаВводНачальныхОстатков, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь);
		
	КонецЕсли;
	
 	Если Не ПроведениеСервер.ВыполнитьКонтрольОстатков() Тогда
		Возврат;
	КонецЕсли;

	Если РазделУчета = "Запасы" Тогда

		ВыполнитьКонтрольЗапасы(ДокументСсылкаВводНачальныхОстатков, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь);

	ИначеЕсли РазделУчета = "Денежные средства" Тогда

		ВыполнитьКонтрольДенежныеСредства(ДокументСсылкаВводНачальныхОстатков, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь);

	КонецЕсли;

КонецПроцедуры
